In [6]:
import pandas as pd
df1 = pd.DataFrame({
    
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35]
    
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [11]:

df2 = pd.DataFrame({
    
    "city":["chicago","new york","michigan"],
    "humidity":[68,65,75]
    
})
df2

       city  humidity
0   chicago        68
1  new york        65
2  michigan        75

In [12]:
#it is same as database join (intersection or inner-join)
#inner-join is default 
df3 = pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68

## Join Operations

In [13]:
#outer-join (union)

df3 = pd.merge(df1,df2,on='city',how="outer")
df3

       city  temperature  humidity
0  new york         21.0      65.0
1   chicago         14.0      68.0
2   orlando         35.0       NaN
3  michigan          NaN      75.0

In [14]:
#left-join

df3 = pd.merge(df1,df2,on='city',how="left")
df3

       city  temperature  humidity
0  new york           21      65.0
1   chicago           14      68.0
2   orlando           35       NaN

In [15]:
#Right-join

df3 = pd.merge(df1,df2,on='city',how="right")
df3

       city  temperature  humidity
0  new york         21.0        65
1   chicago         14.0        68
2  michigan          NaN        75

In [16]:
# to indentify whare are the data comes from---use indicator

df3 = pd.merge(df1,df2,on='city',how="outer",indicator=True)
df3

       city  temperature  humidity      _merge
0  new york         21.0      65.0        both
1   chicago         14.0      68.0        both
2   orlando         35.0       NaN   left_only
3  michigan          NaN      75.0  right_only

### We can use suffixes to distinguish  same column name

In [17]:
df1 = pd.DataFrame({
    
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
    
})
df1

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [18]:
df2 = pd.DataFrame({
    
    "city":["mumbai","chicago","banglore"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
    
})
df2

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [27]:
df3 = pd.merge(df1,df2, on="city", suffixes=('_left','_right'))
df3

Empty DataFrame
Columns: [city, temperature_left, humidity_left, temperature_right, humidity_right]
Index: []